test/jmeter/report/statistics.json
{
  "GET Events Public" : {
    "transaction" : "GET Events Public",
    "sampleCount" : 250,
    "errorCount" : 250,
    "errorPct" : 100.0,
    "meanResTime" : 0.6680000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.490000000000009,
    "throughput" : 8.523114687031228,
    "receivedKBytesPerSec" : 21.89042151063685,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 250,
    "errorCount" : 250,
    "errorPct" : 100.0,
    "meanResTime" : 0.6680000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.490000000000009,
    "throughput" : 8.523114687031228,
    "receivedKBytesPerSec" : 21.89042151063685,
    "sentKBytesPerSec" : 0.0
  }
}