test/jmeter/report_20250818_233547/statistics.json
{
  "GET Events Public" : {
    "transaction" : "GET Events Public",
    "sampleCount" : 250,
    "errorCount" : 2,
    "errorPct" : 0.8,
    "meanResTime" : 510.8920000000002,
    "medianResTime" : 477.0,
    "minResTime" : 382.0,
    "maxResTime" : 1179.0,
    "pct1ResTime" : 638.3000000000001,
    "pct2ResTime" : 760.25,
    "pct3ResTime" : 1156.5600000000004,
    "throughput" : 7.835271257090921,
    "receivedKBytesPerSec" : 12.310435406023757,
    "sentKBytesPerSec" : 1.025318699658382
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 250,
    "errorCount" : 2,
    "errorPct" : 0.8,
    "meanResTime" : 510.8920000000002,
    "medianResTime" : 477.0,
    "minResTime" : 382.0,
    "maxResTime" : 1179.0,
    "pct1ResTime" : 638.3000000000001,
    "pct2ResTime" : 760.25,
    "pct3ResTime" : 1156.5600000000004,
    "throughput" : 7.835271257090921,
    "receivedKBytesPerSec" : 12.310435406023757,
    "sentKBytesPerSec" : 1.025318699658382
  }
}